[
  {
    "id": "1",
    "title": "React Kasa",
    "image": "./kasa-1.png",
    "logos": ["./reactjs.webp", "./html.png", "./js.png", "./css.png"],
    "link": "https://github.com/ImaneZ21/react-kasa",
    "description": {
      "context": "Situation et enjeux du projet",
      "goal": "Buts à atteindre et problématiques à résoudre",
      "stack": " Technologies et outils utilisés",
      "skills": "Apprentissages et défis relevés",
      "results": "Livrables et métriques de réussite",
      "improvement": "Points d'optimisation identifiés"
    }
  },
  {
    "id": "2",
    "title": "Dev Web Link",
    "image": "./books-1.png",
    "logos": ["./reactjs.webp", "./html.png", "./js.png", "./css.png"],
    "link": "https://github.com/ImaneZ21/P7-Dev-Web-livres",
    "description": {
      "context": "Situation et enjeux du projet",
      "goal": "Buts à atteindre et problématiques à résoudre",
      "stack": " Technologies et outils utilisés",
      "skills": "Apprentissages et défis relevés",
      "results": "Livrables et métriques de réussite",
      "improvement": "Points d'optimisation identifiés"
    }
  },
  {
    "id": "3",
    "title": "Nina carducci",
    "logos": ["./reactjs.webp", "./html.png", "./js.png", "./css.png"],
    "image": "https://s3-eu-west-1.amazonaws.com/course.oc-static.com/projects/front-end-kasa-project/accommodation-20-1.jpg",
    "link": "https://github.com/ImaneZ21/Nina-Carducci-Dev",
    "description": {
      "context": "Le projet “Nina Carducci” consistait à créer le site vitrine d'une photographe professionnelle souhaitant valoriser son travail et attirer de nouveaux clients. Le site devait être à la fois esthétique, rapide et accessible, tout en reflétant l'univers artistique de la cliente.",
      "goal": "L'objectif principal était d'optimiser les performances et le référencement du site existant afin d'améliorer sa visibilité sur les moteurs de recherche. Il fallait également corriger les erreurs techniques et garantir une navigation fluide sur tous les supports.",
      "stack": "Le projet a été réalisé avec HTML5, CSS3, JavaScript, et Bootstrap pour la mise en page responsive. Les outils Lighthouse, Wave, et Chrome DevTools ont été utilisés pour l’audit des performances, de l’accessibilité et du SEO.",
      "skills": "J’ai appris à diagnostiquer et corriger des problèmes de performance (optimisation d’images, minification des fichiers, lazy loading), à améliorer le référencement naturel, et à rendre un site conforme aux bonnes pratiques d’accessibilité.s",
      "results": "Le score Lighthouse est passé de 60 à plus de 95 pour les performances et l’accessibilité. Le site se charge désormais en moins de deux secondes et offre une meilleure expérience utilisateur sur mobile et desktop.",
      "improvement": "Les prochaines étapes pourraient inclure l’intégration d’un CMS comme WordPress pour faciliter la mise à jour du contenu, ainsi qu’un suivi analytique plus poussé via Google Analytics."
    }
  }
]
